import 'package:mercikala/src/ui/widgets/show_all_product_item.dart';

var HomeData = {
  'top_banner1': {'id': 1, 'url': 'assets/image/top_banner.jpg'},
  'top_banner2': [
    {'id': 2, 'url': 'assets/image/slider5.jpg'},
    {'id': 1, 'url': 'assets/image/slider3.jpg'},
    {'id': 3, 'url': 'assets/image/slider2.jpg'},
    {'id': 3, 'url': 'assets/image/slider4.jpg'},
  ],
  'top_banner3': [
    {'id': 1, 'url': 'assets/image/slide.jpg'},
    {'id': 2, 'url': 'assets/image/slide.jpg'},
    {'id': 3, 'url': 'assets/image/slide.jpg'}
  ],
  'top_banner4': {'id': 1, 'url': 'assets/image/pic1.png'},
  'disCountList': [
    {
      'id': 1,
      'price': 102223,
      'orginal_price': 100000,
      'url': 'assets/image/product1.jpg',
      'title':'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است،'
    },
    {
      'id': 1,
      'price': 102223,
      'orginal_price': 100000,
      'url': 'assets/image/product2.jpg',
      'title':'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است،'
    },
    {
      'id': 1,
      'price': 102223,
      'orginal_price': 100000,
      'url': 'assets/image/product3.jpg',
      'title':'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است،'
    },
    {
      'id': 1,
      'price': 102223,
      'orginal_price': 100000,
      'url': 'assets/image/product4.jpg',
      'title':'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است،'
    },
    {
      'id': 1,
      'price': 102223,
      'orginal_price': 100000,
      'url': 'assets/image/product5.jpg',
      'title':'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است،'
    }
  ],
  'slider_list': [
    {
      'title': 'لوازم آموزشی',
      'sliders': [
        {'id': 1, 'url': 'assets/image/slide1.jpg'},
        {'id': 1, 'url': 'assets/image/slide2.jpg'},
        {'id': 1, 'url': 'assets/image/slide3.jpg'},
        {'id': 1, 'url': 'assets/image/slide4.jpg'}
      ]
    },
    {
      'title': 'متناسب با سلیقه انتخاب کنید',
      'sliders': [
        {'id': 1, 'url': 'assets/image/slide5.jpg'},
        {'id': 1, 'url': 'assets/image/slide6.jpg'},
        {'id': 1, 'url': 'assets/image/slide7.jpg'},
        {'id': 1, 'url': 'assets/image/slide8.jpg'}
      ]
    }
  ],
  'horizontal_list':[
    {
      'title':'محبوب ترین ها',
      'products':[
        {
          'id': 7,
          'price': 102223,
          'orginal_price': 100000,
          'url': 'assets/image/product6.jpg',
          'title':'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است،'
        },
        {
          'id': 8,
          'price': 102223,
          'orginal_price': 100000,
          'url': 'assets/image/product7.jpg',
          'title':'گوشی سامسونگ گلگسی نوت 10 لایت 128 گیگ (گارانتی نمایندگی سامسونگ)'
        },
        {
          'id': 9,
          'price': 102223,
          'orginal_price': 100000,
          'url': 'assets/image/product8.jpg',
          'title':'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است،'
        },
        {
          'id': 1,
          'price': 102223,
          'orginal_price': 100000,
          'url': 'assets/image/product1.jpg',
          'title':'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است،'
        },
        {
          'id': 2,
          'price': 102223,
          'orginal_price': 100000,
          'url': 'assets/image/product2.jpg',
          'title':'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است،'
        }
      ],
    },
    {
      'title':'بیشترین بازدید ها',
      'products':[
        {
          'id': 10,
          'price': 102223,
          'orginal_price': 100000,
          'url': 'assets/image/product9.jpg',
          'title':'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است،'
        },
        {
          'id': 11,
          'price': 102223,
          'orginal_price': 100000,
          'url': 'assets/image/product10.jpg',
          'title':'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است،'
        },
        {
          'id': 3,
          'price': 102223,
          'orginal_price': 100000,
          'url': 'assets/image/product11.jpg',
          'title':'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است،'
        },
        {
          'id': 4,
          'price': 102223,
          'orginal_price': 100000,
          'url': 'assets/image/product1.jpg',
          'title':'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است،'
        },
        {
          'id': 5,
          'price': 102223,
          'orginal_price': 100000,
          'url': 'assets/image/product5.jpg',
          'title':'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است،'
        }
      ],
    }
  ],
  'grid_list':[
    {
      'title':'محصولات محبوب',
      'products':[
        {
          'id': 4,
          'price': 102223,
          'orginal_price': 100000,
          'url': 'assets/image/product4.jpg',
          'title':'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است،'
        },
        {
          'id': 7,
          'price': 102223,
          'orginal_price': 100000,
          'url': 'assets/image/product7.jpg',
          'title':'گوشی سامسونگ گلگسی نوت 10 لایت 128 گیگ (گارانتی نمایندگی سامسونگ)'
        },
        {
          'id': 10,
          'price': 102223,
          'orginal_price': 100000,
          'url': 'assets/image/product10.jpg',
          'title':'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است،'
        },
        {
          'id': 6,
          'price': 102223,
          'orginal_price': 100000,
          'url': 'assets/image/product6.jpg',
          'title':'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است،'
        }
      ],
    },
    {
      'title':'محصولات ویژه',
      'products':[
        {
          'id': 2,
          'price': 102223,
          'orginal_price': 100000,
          'url': 'assets/image/product2.jpg',
          'title':'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است،'
        },
        {
          'id': 5,
          'price': 102223,
          'orginal_price': 100000,
          'url': 'assets/image/product5.jpg',
          'title':'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است،'
        },
        {
          'id': 7,
          'price': 102223,
          'orginal_price': 100000,
          'url': 'assets/image/product7.jpg',
          'title':'گوشی سامسونگ گلگسی نوت 10 لایت 128 گیگ (گارانتی نمایندگی سامسونگ)'
        },
        {
          'id': 9,
          'price': 102223,
          'orginal_price': 100000,
          'url': 'assets/image/product9.jpg',
          'title':'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است،'
        }
      ],
    },
    {
      'title':'تلویزیون',
      'products':[
        {
          'id': 1,
          'price': 102223,
          'orginal_price': 100000,
          'url': 'assets/image/product5.jpg',
          'title':'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است،'
        },
        {
          'id': 1,
          'price': 102223,
          'orginal_price': 100000,
          'url': 'assets/image/product6.jpg',
          'title':'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است،'
        },
        {
          'id': 1,
          'price': 102223,
          'orginal_price': 100000,
          'url': 'assets/image/product12.jpg',
          'title':'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است،'
        },
        {
          'id': 1,
          'price': 102223,
          'orginal_price': 100000,
          'url': 'assets/image/product13.jpg',
          'title':'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است،'
        }
      ],
    },
    {
      'title':'گوشی',
      'products':[
        {
          'id': 1,
          'price': 102223,
          'orginal_price': 100000,
          'url': 'assets/image/product3.jpg',
          'title':'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است،'
        },
        {
          'id': 1,
          'price': 102223,
          'orginal_price': 100000,
          'url': 'assets/image/product7.jpg',
          'title':'گوشی سامسونگ گلگسی نوت 10 لایت 128 گیگ (گارانتی نمایندگی سامسونگ)'
        },
        {
          'id': 1,
          'price': 102223,
          'orginal_price': 100000,
          'url': 'assets/image/product14.jpg',
          'title':'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است،'
        },
        {
          'id': 1,
          'price': 102223,
          'orginal_price': 100000,
          'url': 'assets/image/product15.jpg',
          'title':'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است،'
        }
      ],
    }
  ]
};

var productDetailsData = [
    'assets/image/product7.jpg',
    'assets/image/pdetail1.jpg',
    'assets/image/pdetai2.jpg',
    'assets/image/pdetail1.jpg',
  ];
